<a href="https://colab.research.google.com/github/mjplacroix/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/LS_DS11_113_Join_and_Reshape_Data_Assignment_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [2]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-12-05 21:09:39--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.186.197
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.186.197|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  35.9MB/s    in 6.0s

2019-12-05 21:09:50 (32.7 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [3]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [4]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [5]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
##### YOUR CODE HERE #####

import pandas as pd

In [15]:
#condition to filter the products dataframe by to get only the product_ids
#needed for merging with total products
condition = ((products['product_name'] == "Banana" ) |
             (products['product_name'] == 'Bag of Organic Bananas') |
             (products['product_name'] == 'Organic Strawberries') |
             (products['product_name'] == 'Organic Baby Spinach') |
             (products['product_name'] == 'Organic Hass Avocado') |
             (products['product_name'] == 'Organic Avocado') |
             (products['product_name'] == 'Large Lemon') |
             (products['product_name'] == 'Strawberries') |
             (products['product_name'] == 'Limes') |
             (products['product_name'] == 'Organic Whole Milk')
              )
top_products = products[condition]
print(top_products.shape)
top_products.head(10)

(10, 4)

       product_id            product_name  aisle_id  department_id
13175       13176  Bag of Organic Bananas        24              4
16796       16797            Strawberries        24              4
21136       21137    Organic Strawberries        24              4
21902       21903    Organic Baby Spinach       123              4
24851       24852                  Banana        24              4
26208       26209                   Limes        24              4
27844       27845      Organic Whole Milk        84             16
47208       47209    Organic Hass Avocado        24              4
47625       47626             Large Lemon        24              4
47765       47766         Organic Avocado        24              4

In [16]:
#merging orders dataframe with top_products dataframe to match
#product_ids for counting purposes
top_10_products = pd.merge(top_products, 
                           order_products, 
                           on='product_id',
                           how='inner')
print(top_10_products.shape)
top_10_products.head(10)

# orders_and_products = pd.merge(orders_subset, 
#                                order_products_subset, 
#                                on='order_id', 
#                                how='inner')
# print(orders_and_products.shape)
# orders_and_products.head(11)

(2418314, 7)

   product_id            product_name  ...  add_to_cart_order  reordered
0       13176  Bag of Organic Bananas  ...                  1          1
1       13176  Bag of Organic Bananas  ...                  1          1
2       13176  Bag of Organic Bananas  ...                  3          1
3       13176  Bag of Organic Bananas  ...                  3          1
4       13176  Bag of Organic Bananas  ...                  3          1
5       13176  Bag of Organic Bananas  ...                  6          1
6       13176  Bag of Organic Bananas  ...                  4          1
7       13176  Bag of Organic Bananas  ...                  5          1
8       13176  Bag of Organic Bananas  ...                  1          1
9       13176  Bag of Organic Bananas  ...                  1          1

[10 rows x 7 columns]

In [32]:
#removing columns deemed unnecessary for the analysis
top_10_products = top_10_products.drop(['add_to_cart_order'], axis=1)

top_10_products.head(10)

KeyError: ignored

In [24]:
#count of top 10 most order products
top_10_products['product_name'].value_counts(dropna=False)

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [7]:
#replicating the lesson code

import pandas as pd

order_products__prior = pd.read_csv('order_products__prior.csv')
order_products__prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [8]:
order_products__train = pd.read_csv('order_products__train.csv')
order_products__train.head()

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [9]:
products = pd.read_csv('products.csv')
products.head()

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [11]:
orders = pd.read_csv('orders.csv')
orders.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [10]:
order_products__prior.shape

(32434489, 4)

In [12]:
order_products__train.shape

(1384617, 4)

In [13]:
order_products = pd.concat([order_products__prior, order_products__train])

order_products.shape

(33819106, 4)

In [26]:
#creating a condition to filter the order_products dataframe with
condition = (orders['order_id'] <= 10)

orders_sample = orders[condition]
print(orders_sample.shape)
orders_sample.head(10)

(10, 7)

         order_id  user_id  ... order_hour_of_day  days_since_prior_order
50028           8     3107  ...                 6                    17.0
370620          6    22352  ...                12                    30.0
1868044         1   112108  ...                10                     9.0
2249060        10   135442  ...                 8                     8.0
2308534         9   139016  ...                19                     5.0
2374153         7   142903  ...                14                    30.0
2593373         5   156122  ...                16                     9.0
2958007         4   178520  ...                 9                     7.0
3355525         2   202279  ...                 9                     8.0
3417191         3   205970  ...                17                    12.0

[10 rows x 7 columns]

In [28]:
#removing some columns unnecessary for the analysis
orders_sample = orders_sample.drop(['eval_set', 'order_hour_of_day'], axis=1)

orders_sample.head(10)


# orders_and_products = orders_and_products.drop(['eval_set', 
#                                                 'reordered', 
#                                                 'days_since_prior_order'], 
#                                                 axis=1)

# orders_and_products.head(11)

         order_id  user_id  order_number  order_dow  days_since_prior_order
50028           8     3107             5          4                    17.0
370620          6    22352             4          1                    30.0
1868044         1   112108             4          4                     9.0
2249060        10   135442             4          6                     8.0
2308534         9   139016            14          0                     5.0
2374153         7   142903            11          2                    30.0
2593373         5   156122            42          6                     9.0
2958007         4   178520            36          1                     7.0
3355525         2   202279             3          5                     8.0
3417191         3   205970            16          5                    12.0

In [35]:
orders_sample['days_since_prior_order']

50028      17.0
370620     30.0
1868044     9.0
2249060     8.0
2308534     5.0
2374153    30.0
2593373     9.0
2958007     7.0
3355525     8.0
3417191    12.0
Name: days_since_prior_order, dtype: float64

In [38]:
#defining condition with which to sort the dataframe by 
condition_2 = order_products['order_id'].isin(orders_sample['order_id'])

some_products_subset = order_products[condition_2]

print(some_products_subset.shape)
some_products_subset.head(10)


# condition = products[''].isin(orders_and_products['product_id'])

# products_subset = products[condition]

# products_subset

(100, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0
5         2       17794                  6          1
6         2       40141                  7          1
7         2        1819                  8          1
8         2       43668                  9          0
9         3       33754                  1          1

In [39]:
#more practice dropping some uneccessary rows
some_products_subset = some_products_subset.drop(['add_to_cart_order'], axis=1)

some_products_subset.head(10)

# final = final.drop(['aisle_id', 'department_id'], axis=1)

# final

   order_id  product_id  reordered
0         2       33120          1
1         2       28985          1
2         2        9327          0
3         2       45918          1
4         2       30035          0
5         2       17794          1
6         2       40141          1
7         2        1819          1
8         2       43668          0
9         3       33754          1

In [40]:
# sort rows
some_products_subset = some_products_subset.sort_values(by=['order_id'])
some_products_subset.head(20)


# final = final.sort_values(by=['order_number', 'add_to_cart_order'])
# final

    order_id  product_id  reordered
7          1       22035          1
5          1       13176          0
4          1       43633          1
3          1       49683          0
2          1       10246          0
1          1       11109          1
0          1       49302          1
6          1       47209          0
0          2       33120          1
7          2        1819          1
1          2       28985          1
2          2        9327          0
3          2       45918          1
4          2       30035          0
5          2       17794          1
6          2       40141          1
8          2       43668          0
9          3       33754          1
16         3       32665          1
15         3       17461          1

In [41]:
#reorder columsn and remove the underscores from the column titles
some_products_subset = some_products_subset[['order_id', 'reordered', 'product_id']]
some_products_subset.columns = [column.replace('_', ' ') for column in some_products_subset]
some_products_subset.head(20)

# # reorder columns
# final = final[['user_id', 'order_id', 'order_number', 'order_dow', 'order_hour_of_day', 'add_to_cart_order', 'product_id', 'product_name']]
# final

# # remove underscores from column headers
# final.columns = [column.replace('_', ' ') for column in final]
# final

    order id  reordered  product id
7          1          1       22035
5          1          0       13176
4          1          1       43633
3          1          0       49683
2          1          0       10246
1          1          1       11109
0          1          1       49302
6          1          0       47209
0          2          1       33120
7          2          1        1819
1          2          1       28985
2          2          0        9327
3          2          1       45918
4          2          0       30035
5          2          1       17794
6          2          1       40141
8          2          0       43668
9          3          1       33754
16         3          1       32665
15         3          1       17461

- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [42]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [65]:
# table2 -> tidy

tidy2 = table2.melt(id_vars=['John Smith', 'Jane Doe', 'Mary Johnson'], value_vars=[16.0])
tidy2

# tidy1 = table1.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])

# tidy1

KeyError: ignored

In [0]:
# tidy -> table2

In [46]:
import seaborn as sns
flights = sns.load_dataset('flights')

flights

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [50]:
flights.columns

Index(['year', 'month', 'passengers'], dtype='object')

In [48]:
# Flights Pivot Table

pivot_pilots_table = flights.pivot_table(index='year', columns='month', value='passengers')
pivot_pilots_table


# index: unique identifier
# columns: What do you want to differentiate the columns in wide format
# values: Where are the numbers at - go in the middle of the wide dataframe

# wide = tidy1.pivot_table(index='name', columns='trt', values='result')

# wide

TypeError: ignored

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####